app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "last_name" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Bories"], ["password", "newpassword"], ["updated_at", "2019-04-13 19:46:26.566117"], ["id", 1]]
---
  def update
    if @user.update(user_params)